The duct/pipe size is invalid for the service definition
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId DuctPipeSizeMismatch { get; }
  Visual Basic
Public Shared ReadOnly Property DuctPipeSizeMismatch As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ DuctPipeSizeMismatch {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures PipingFailures Class
  Autodesk.Revit.DB Namespace